micropython/micropython/ports/stm32/spi.c
//    // set IRQ priority (if not a special timer)
//     if (self->tim_id != 5) {
//         NVIC_SetPriority(IRQn_NONNEG(self->irqn), IRQ_PRI_TIMX);
//         if (self->tim_id == 1) {
//             #if defined(TIM1)
//             NVIC_SetPriority(TIM1_CC_IRQn, IRQ_PRI_TIMX);
//             #endif
//         } else if (self->tim_id == 8) {
//             #if defined(TIM8)
//             NVIC_SetPriority(TIM8_CC_IRQn, IRQ_PRI_TIMX);
//             #endif
//         }
//     }

// /// \method callback(fun)
// /// Set the function to be called when the timer triggers.
// /// `fun` is passed 1 argument, the timer object.
// /// If `fun` is `None` then the callback will be disabled.
// STATIC mp_obj_t pyb_timer_callback(mp_obj_t self_in, mp_obj_t callback) {
//     pyb_timer_obj_t *self = MP_OBJ_TO_PTR(self_in);
//     if (callback == mp_const_none) {
//         // stop interrupt (but not timer)
//         __HAL_TIM_DISABLE_IT(&self->tim, TIM_IT_UPDATE);
//         self->callback = mp_const_none;
//     } else if (mp_obj_is_callable(callback)) {
//         __HAL_TIM_DISABLE_IT(&self->tim, TIM_IT_UPDATE);
//         self->callback = callback;
//         // start timer, so that it interrupts on overflow, but clear any
//         // pending interrupts which may have been set by initializing it.
//         __HAL_TIM_CLEAR_FLAG(&self->tim, TIM_IT_UPDATE);
//         HAL_TIM_Base_Start_IT(&self->tim); // This will re-enable the IRQ
//         HAL_NVIC_EnableIRQ(self->irqn);
//     } else {
//         mp_raise_ValueError("callback must be None or a callable object");
//     }
//     return mp_const_none;
// }
// STATIC MP_DEFINE_CONST_FUN_OBJ_2(pyb_timer_callback_obj, pyb_timer_callback);

// void timer_irq_handler(uint tim_id) {
//     if (tim_id - 1 < PYB_TIMER_OBJ_ALL_NUM) {
//         // get the timer object
//         pyb_timer_obj_t *tim = MP_STATE_PORT(pyb_timer_obj_all)[tim_id - 1];

//         if (tim == NULL) {
//             // Timer object has not been set, so we can't do anything.
//             // This can happen under normal circumstances for timers like
//             // 1 & 10 which use the same IRQ.
//             return;
//         }

//         // Check for timer (versus timer channel) interrupt.
//         timer_handle_irq_channel(tim, 0, tim->callback);
//         uint32_t handled = TIMER_IRQ_MASK(0);

//         // Check to see if a timer channel interrupt was pending
//         pyb_timer_channel_obj_t *chan = tim->channel;
//         while (chan != NULL) {
//             timer_handle_irq_channel(tim, chan->channel, chan->callback);
//             handled |= TIMER_IRQ_MASK(chan->channel);
//             chan = chan->next;
//         }

//         // Finally, clear any remaining interrupt sources. Otherwise we'll
//         // just get called continuously.
//         uint32_t unhandled = tim->tim.Instance->DIER & 0xff & ~handled;
//         if (unhandled != 0) {
//             __HAL_TIM_DISABLE_IT(&tim->tim, unhandled);
//             __HAL_TIM_CLEAR_IT(&tim->tim, unhandled);
//             mp_printf(MICROPY_ERROR_PRINTER, "unhandled interrupt SR=0x%02x (now disabled)\n", (unsigned int)unhandled);
//         }
//     }
// }

// /// \method callback(fun)
// /// Set the function to be called when the timer triggers.
// /// `fun` is passed 1 argument, the timer object.
// /// If `fun` is `None` then the callback will be disabled.
// STATIC mp_obj_t pyb_timer_callback(mp_obj_t self_in, mp_obj_t callback) {
//     pyb_timer_obj_t *self = MP_OBJ_TO_PTR(self_in);
//     if (callback == mp_const_none) {
//         // stop interrupt (but not timer)
//         __HAL_TIM_DISABLE_IT(&self->tim, TIM_IT_UPDATE);
//         self->callback = mp_const_none;
//     } else if (mp_obj_is_callable(callback)) {
//         __HAL_TIM_DISABLE_IT(&self->tim, TIM_IT_UPDATE);
//         self->callback = callback;
//         // start timer, so that it interrupts on overflow, but clear any
//         // pending interrupts which may have been set by initializing it.
//         __HAL_TIM_CLEAR_FLAG(&self->tim, TIM_IT_UPDATE);
//         HAL_TIM_Base_Start_IT(&self->tim); // This will re-enable the IRQ
//         HAL_NVIC_EnableIRQ(self->irqn);
//     } else {
//         mp_raise_ValueError("callback must be None or a callable object");
//     }
//     return mp_const_none;
// }
// STATIC MP_DEFINE_CONST_FUN_OBJ_2(pyb_timer_callback_obj, pyb_timer_callback);

    // // Start the timer running
    // if (args[ARG_callback].u_obj == mp_const_none) {
    //     HAL_TIM_Base_Start(&self->tim);
    // } else {
    //     pyb_timer_callback(MP_OBJ_FROM_PTR(self), args[ARG_callback].u_obj);
    // }

/////////////////////////////////////
// How to handle the callback
/////////////////////////////////////
            // // execute callback if it's set
            // if (callback != mp_const_none) {
            //     mp_sched_lock();
            //     // When executing code within a handler we must lock the GC to prevent
            //     // any memory allocations.  We must also catch any exceptions.
            //     gc_lock();
            //     nlr_buf_t nlr;
            //     if (nlr_push(&nlr) == 0) {
            //         mp_call_function_1(callback, MP_OBJ_FROM_PTR(tim));
            //         nlr_pop();
            //     } else {
            //         // Uncaught exception; disable the callback so it doesn't run again.
            //         tim->callback = mp_const_none;
            //         __HAL_TIM_DISABLE_IT(&tim->tim, irq_mask);
            //         if (channel == 0) {
            //             mp_printf(MICROPY_ERROR_PRINTER, "uncaught exception in Timer(%u) interrupt handler\n", tim->tim_id);
            //         } else {
            //             mp_printf(MICROPY_ERROR_PRINTER, "uncaught exception in Timer(%u) channel %u interrupt handler\n", tim->tim_id, channel);
            //         }
            //         mp_obj_print_exception(&mp_plat_print, MP_OBJ_FROM_PTR(nlr.ret_val));
            //     }
            //     gc_unlock();
            //     mp_sched_unlock();
            // }


           // // execute callback if it's set
            // if (callback != mp_const_none) {
            //     mp_sched_lock();
            //     // When executing code within a handler we must lock the GC to prevent
            //     // any memory allocations.  We must also catch any exceptions.
            //     gc_lock();
            //     nlr_buf_t nlr;
            //     if (nlr_push(&nlr) == 0) {
            //         mp_call_function_1(callback, MP_OBJ_FROM_PTR(tim));
            //         nlr_pop();
            //     } else {
            //         // Uncaught exception; disable the callback so it doesn't run again.
            //         tim->callback = mp_const_none;
            //         __HAL_TIM_DISABLE_IT(&tim->tim, irq_mask);
            //         if (channel == 0) {
            //             mp_printf(MICROPY_ERROR_PRINTER, "uncaught exception in Timer(%u) interrupt handler\n", tim->tim_id);
            //         } else {
            //             mp_printf(MICROPY_ERROR_PRINTER, "uncaught exception in Timer(%u) channel %u interrupt handler\n", tim->tim_id, channel);
            //         }
            //         mp_obj_print_exception(&mp_plat_print, MP_OBJ_FROM_PTR(nlr.ret_val));
            //     }
            //     gc_unlock();
            //     mp_sched_unlock();
            // }

