micropython/micropython/ports/stm32/spi.c
        case MP_SPI_IOCTL_DEINIT:
            spi_deinit(self->spi);
            break;
    }

    return 0;
}

STATIC void spi_proto_transfer(void *self_in, size_t len, const uint8_t *src, uint8_t *dest) {
    spi_proto_cfg_t *self = (spi_proto_cfg_t *)self_in;
    spi_transfer(self->spi, len, src, dest, SPI_TRANSFER_TIMEOUT(len));
}

const mp_spi_proto_t spi_proto = {
    .ioctl = spi_proto_ioctl,
    .transfer = spi_proto_transfer,
};


#ifdef SPIDMA_MODES

/**
  * @brief Tx Transfer completed callback.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hspi);

  printf("\nHAL_SPI_TxCpltCallback called\n");
}

/**
  * @brief Rx Transfer completed callback.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi)
{
  /* Prevent unused argument(s) compilation warning */
    UNUSED(hspi);

    printf("\nHAL_SPI_RxCpltCallback called\n");

}

// /**
//   * @brief  DMA handle Structure definition
//   */
// typedef struct __DMA_HandleTypeDef
// {
//   DMA_Channel_TypeDef    *Instance;                                                  /*!< Register base address                */

//   DMA_InitTypeDef       Init;                                                        /*!< DMA communication parameters         */

//   HAL_LockTypeDef       Lock;                                                        /*!< DMA locking object                   */

//   __IO HAL_DMA_StateTypeDef  State;                                                  /*!< DMA transfer state                   */

//   void                  *Parent;                                                     /*!< Parent object state                  */

//   void                  (* XferCpltCallback)(struct __DMA_HandleTypeDef * hdma);     /*!< DMA transfer complete callback       */

//   void                  (* XferHalfCpltCallback)(struct __DMA_HandleTypeDef * hdma); /*!< DMA Half transfer complete callback  */

//   void                  (* XferErrorCallback)(struct __DMA_HandleTypeDef * hdma);    /*!< DMA transfer error callback          */

//   void                  (* XferAbortCallback)( struct __DMA_HandleTypeDef * hdma);   /*!< DMA transfer abort callback          */

//   __IO uint32_t          ErrorCode;                                                  /*!< DMA Error code                       */

//   DMA_TypeDef            *DmaBaseAddress;                                            /*!< DMA Channel Base Address             */

//   uint32_t               ChannelIndex;                                               /*!< DMA Channel Index                    */
// }DMA_HandleTypeDef;

// /**
//   * @brief  SPI handle Structure definition
//   */
// typedef struct __SPI_HandleTypeDef
// {
//   SPI_TypeDef                *Instance;      /*!< SPI registers base address               */

//   SPI_InitTypeDef            Init;           /*!< SPI communication parameters             */

//   uint8_t                    *pTxBuffPtr;    /*!< Pointer to SPI Tx transfer Buffer        */

//   uint16_t                   TxXferSize;     /*!< SPI Tx Transfer size                     */

//   __IO uint16_t              TxXferCount;    /*!< SPI Tx Transfer Counter                  */

//   uint8_t                    *pRxBuffPtr;    /*!< Pointer to SPI Rx transfer Buffer        */

//   uint16_t                   RxXferSize;     /*!< SPI Rx Transfer size                     */

//   __IO uint16_t              RxXferCount;    /*!< SPI Rx Transfer Counter                  */

//   uint32_t                   CRCSize;        /*!< SPI CRC size used for the transfer       */

//   void (*RxISR)(struct __SPI_HandleTypeDef *hspi);   /*!< function pointer on Rx ISR       */

//   void (*TxISR)(struct __SPI_HandleTypeDef *hspi);   /*!< function pointer on Tx ISR       */

//   DMA_HandleTypeDef          *hdmatx;        /*!< SPI Tx DMA Handle parameters             */

//   DMA_HandleTypeDef          *hdmarx;        /*!< SPI Rx DMA Handle parameters             */

//   HAL_LockTypeDef            Lock;           /*!< Locking object                           */

//   __IO HAL_SPI_StateTypeDef  State;          /*!< SPI communication state                  */

//   __IO uint32_t              ErrorCode;      /*!< SPI Error code                           */

// } SPI_HandleTypeDef;

STATIC void callcallback(mp_obj_t spi_id, mp_obj_t callback)
{
    // execute callback. vetted long before getting here.
    mp_sched_lock();
    // When executing code within a handler we must lock the GC to prevent
    // any memory allocations.  We must also catch any exceptions.
    gc_lock();
    nlr_buf_t nlr;
    if (nlr_push(&nlr) == 0) {
        mp_call_function_1(callback, spi_id);
        nlr_pop();
    } else {
        // Uncaught exception
        mp_printf(MICROPY_ERROR_PRINTER, "uncaught exception in SPI(%d) interrupt handler\n", spi_id);
        mp_obj_print_exception(&mp_plat_print, MP_OBJ_FROM_PTR(nlr.ret_val));
    }
    gc_unlock();
    mp_sched_unlock();
}

/**
  * @brief Tx and Rx Transfer completed callback.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi)
{
    int spi_obj_offset = -1;

    printf("\nHAL_SPI_TxRxCpltCallback called\n");
    if (0) {
    }
    #if defined(MICROPY_HW_SPI1_SCK)
    else if (hspi->Instance == SPI1) {
        spi_obj_offset = 0;
    }
    #endif
    #if defined(MICROPY_HW_SPI2_SCK)
    else if (hspi->Instance == SPI2) {
        spi_obj_offset = 1;
    }
    #endif
    #if defined(MICROPY_HW_SPI3_SCK)
    else if (hspi->Instance == SPI3) {
        spi_obj_offset = 2;
    }
    #endif
    #if defined(MICROPY_HW_SPI4_SCK)
    else if (hspi->Instance == SPI4) {
        spi_obj_offset = 3;
    }
    #endif
    #if defined(MICROPY_HW_SPI5_SCK)
    else if (hspi->Instance == SPI5) {
        spi_obj_offset = 4;
    }
    #endif
    #if defined(MICROPY_HW_SPI6_SCK)
    else if (hspi->Instance == SPI6) {
        spi_obj_offset = 5;
    }
    #endif

    if ( spi_obj_offset >= 0)
    {
        SPI_DMAHandleTypeDef * dma_modes = spi_obj[spi_obj_offset].dma_modes;
        if (dma_modes){
            mp_obj_t callback = dma_modes->callback;
            printf("\ncallback(spi_id = %d) = 0x%X\n", spi_obj_offset+1, (unsigned int) callback);
            // execute callback if it's set. vetted long before getting here.
            if (callback != (mp_obj_t) NULL){
                callcallback(mp_obj_new_int(spi_obj_offset+1), callback);
            }
        }
    }
}

/**
  * @brief Tx and Rx Half Transfer callback.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
void HAL_SPI_TxRxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
    printf("\nHAL_SPI_TxRxHalfCpltCallback called\n");
    int spi_obj_offset = -1;

    if (0) {
    }
    #if defined(MICROPY_HW_SPI1_SCK)
    else if (hspi->Instance == SPI1) {
        spi_obj_offset = 0;
    }
    #endif
    #if defined(MICROPY_HW_SPI2_SCK)
    else if (hspi->Instance == SPI2) {
        spi_obj_offset = 1;
    }
    #endif
    #if defined(MICROPY_HW_SPI3_SCK)
    else if (hspi->Instance == SPI3) {
        spi_obj_offset = 2;
    }
    #endif
    #if defined(MICROPY_HW_SPI4_SCK)
    else if (hspi->Instance == SPI4) {
        spi_obj_offset = 3;
    }
    #endif
    #if defined(MICROPY_HW_SPI5_SCK)
    else if (hspi->Instance == SPI5) {
        spi_obj_offset = 4;
    }
    #endif
    #if defined(MICROPY_HW_SPI6_SCK)
    else if (hspi->Instance == SPI6) {
        spi_obj_offset = 5;
    }
    #endif

    if ( spi_obj_offset >= 0)
    {
        SPI_DMAHandleTypeDef * dma_modes = spi_obj[spi_obj_offset].dma_modes;
        if (dma_modes){
            mp_obj_t callback = dma_modes->callbackhalf;
            printf("\ncallback(spi_id = %d) = 0x%X\n", spi_obj_offset+1, (unsigned int) callback);
            // execute callback if it's set. vetted long before getting here.
            if (callback != (mp_obj_t) NULL){
                callcallback(mp_obj_new_int(spi_obj_offset+1), callback);
            }
        }
    }
}

/**
  * @brief Tx Half Transfer completed callback.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
void HAL_SPI_TxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
    printf("\nHAL_SPI_TxHalfCpltCallback called\n");
    HAL_SPI_TxRxHalfCpltCallback(hspi);
}

/**
  * @brief Rx Half Transfer completed callback.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
void HAL_SPI_RxHalfCpltCallback(SPI_HandleTypeDef *hspi)
{
    printf("\nHAL_SPI_RxHalfCpltCallback called\n");
    HAL_SPI_TxRxHalfCpltCallback(hspi);
}



/**
  * @brief SPI error callback.
  * @param  hspi: pointer to a SPI_HandleTypeDef structure that contains
  *               the configuration information for SPI module.
  * @retval None
  */
void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
    printf("\nHAL_SPI_ErrorCallback called\n");

    /* NOTE : The ErrorCode parameter in the hspi handle is updated by the SPI processes
            and user can use HAL_SPI_GetError() API to check the latest error occurred
    */
    int spi_obj_offset = -1;

    printf("\nHAL_SPI_TxRxCpltCallback called\n");
    if (0) {
    }
    #if defined(MICROPY_HW_SPI1_SCK)
    else if (hspi->Instance == SPI1) {
        spi_obj_offset = 0;
    }
    #endif
    #if defined(MICROPY_HW_SPI2_SCK)
    else if (hspi->Instance == SPI2) {
        spi_obj_offset = 1;
    }
    #endif
    #if defined(MICROPY_HW_SPI3_SCK)
    else if (hspi->Instance == SPI3) {
        spi_obj_offset = 2;
    }
    #endif
    #if defined(MICROPY_HW_SPI4_SCK)
    else if (hspi->Instance == SPI4) {
        spi_obj_offset = 3;
    }
    #endif
    #if defined(MICROPY_HW_SPI5_SCK)
    else if (hspi->Instance == SPI5) {
        spi_obj_offset = 4;
    }
    #endif
    #if defined(MICROPY_HW_SPI6_SCK)
    else if (hspi->Instance == SPI6) {
        spi_obj_offset = 5;
    }
    #endif

    if ( spi_obj_offset >= 0)
    {
        SPI_DMAHandleTypeDef * dma_modes = spi_obj[spi_obj_offset].dma_modes;
        if (dma_modes){
            mp_obj_t callback = dma_modes->callbackerror;
            printf("\ncallback(spi_id = %d) = 0x%X\n", spi_obj_offset+1, (unsigned int) callback);
            // execute callback if it's set. vetted long before getting here.
            if (callback != (mp_obj_t) NULL){
                callcallback(mp_obj_new_int(spi_obj_offset+1), callback);
            }
        }
    }
}
#endif